{"config": {"layers": [{"config": {"strides": [1, 1], "padding": "valid", "kernel_size": [3, 3], "batch_input_shape": [null, 150, 150, 3], "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_1", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"rate": 0.4, "seed": null, "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_1"}, "class_name": "SpatialDropout2D"}, {"config": {"strides": [1, 1], "padding": "valid", "kernel_size": [3, 3], "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_2", "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "padding": "valid", "kernel_size": [3, 3], "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_3", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"rate": 0.4, "seed": null, "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_2"}, "class_name": "SpatialDropout2D"}, {"config": {"strides": [1, 1], "padding": "valid", "kernel_size": [3, 3], "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_4", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "padding": "valid", "kernel_size": [3, 3], "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_5", "bias_regularizer": null, "filters": 128, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"rate": 0.4, "seed": null, "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_3"}, "class_name": "SpatialDropout2D"}, {"config": {"strides": [1, 1], "padding": "valid", "kernel_size": [3, 3], "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_6", "bias_regularizer": null, "filters": 128, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "padding": "valid", "kernel_size": [3, 3], "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_7", "bias_regularizer": null, "filters": 256, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"rate": 0.4, "seed": null, "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_4"}, "class_name": "SpatialDropout2D"}, {"config": {"strides": [1, 1], "padding": "valid", "kernel_size": [3, 3], "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_8", "bias_regularizer": null, "filters": 256, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.5, "seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 155, "kernel_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}