{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": false, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "data_format": "channels_last", "batch_input_shape": [null, 150, 150, 3], "activation": "relu", "filters": 32, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_1", "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_1", "rate": 0.5, "trainable": false, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": false, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "filters": 32, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_2", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": false, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": false, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "filters": 64, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_3", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_2", "rate": 0.5, "trainable": false, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": false, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "filters": 64, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_4", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": false, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": false, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "filters": 128, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_5", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_3", "rate": 0.5, "trainable": false, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": false, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "filters": 128, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_6", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": false, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "filters": 256, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_7", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_4", "rate": 0.5, "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "filters": 256, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_8", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "dense_1", "bias_regularizer": null, "activation": "softmax", "units": 155, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null}}]}}