{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "name": "conv2d_1", "filters": 32, "batch_input_shape": [null, 150, 150, 3], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "use_bias": true}}, {"class_name": "SpatialDropout2D", "config": {"rate": 0.5, "noise_shape": null, "seed": null, "trainable": false, "name": "spatial_dropout2d_1"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_2", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "padding": "valid", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": false, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_3", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "padding": "valid", "bias_regularizer": null}}, {"class_name": "SpatialDropout2D", "config": {"rate": 0.5, "noise_shape": null, "seed": null, "trainable": false, "name": "spatial_dropout2d_2"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_4", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "padding": "valid", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": false, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_5", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "padding": "valid", "bias_regularizer": null}}, {"class_name": "SpatialDropout2D", "config": {"rate": 0.5, "noise_shape": null, "seed": null, "trainable": false, "name": "spatial_dropout2d_3"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_6", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "padding": "valid", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": false, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_7", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "padding": "valid", "bias_regularizer": null}}, {"class_name": "SpatialDropout2D", "config": {"rate": 0.5, "noise_shape": null, "seed": null, "trainable": true, "name": "spatial_dropout2d_4"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_8", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "padding": "valid", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_4", "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "seed": null, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 155, "bias_regularizer": null, "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "use_bias": true}}], "name": "sequential_1"}}