{"keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"name": "conv2d_1", "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "strides": [1, 1], "trainable": false, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "batch_input_shape": [null, 150, 150, 3], "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "dtype": "float32", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"rate": 0.7, "name": "spatial_dropout2d_1", "noise_shape": null, "trainable": false, "seed": null}, "class_name": "SpatialDropout2D"}, {"config": {"name": "conv2d_2", "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "strides": [1, 1], "trainable": false, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": false, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_3", "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "filters": 64, "strides": [1, 1], "trainable": false, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"rate": 0.7, "name": "spatial_dropout2d_2", "noise_shape": null, "trainable": false, "seed": null}, "class_name": "SpatialDropout2D"}, {"config": {"name": "conv2d_4", "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "filters": 64, "strides": [1, 1], "trainable": false, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": false, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_5", "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "filters": 128, "strides": [1, 1], "trainable": false, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"rate": 0.7, "name": "spatial_dropout2d_3", "noise_shape": null, "trainable": false, "seed": null}, "class_name": "SpatialDropout2D"}, {"config": {"name": "conv2d_6", "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "filters": 128, "strides": [1, 1], "trainable": false, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": false, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_7", "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "filters": 256, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"rate": 0.7, "name": "spatial_dropout2d_4", "noise_shape": null, "trainable": true, "seed": null}, "class_name": "SpatialDropout2D"}, {"config": {"name": "conv2d_8", "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "filters": 256, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_4", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.7, "name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "units": 155, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}