{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "dtype": "float32", "trainable": false, "bias_regularizer": null, "padding": "valid", "use_bias": true, "activity_regularizer": null, "name": "conv2d_1", "activation": "relu", "batch_input_shape": [null, 150, 150, 3], "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": false, "seed": null, "rate": 0.5, "name": "spatial_dropout2d_1", "noise_shape": null}, "class_name": "SpatialDropout2D"}, {"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "trainable": false, "bias_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "name": "conv2d_2", "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": false, "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "trainable": false, "bias_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "name": "conv2d_3", "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": false, "seed": null, "rate": 0.5, "name": "spatial_dropout2d_2", "noise_shape": null}, "class_name": "SpatialDropout2D"}, {"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "trainable": false, "bias_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "name": "conv2d_4", "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": false, "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "trainable": false, "bias_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "name": "conv2d_5", "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": false, "seed": null, "rate": 0.5, "name": "spatial_dropout2d_3", "noise_shape": null}, "class_name": "SpatialDropout2D"}, {"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "trainable": false, "bias_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "name": "conv2d_6", "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": false, "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "name": "conv2d_7", "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "seed": null, "rate": 0.5, "name": "spatial_dropout2d_4", "noise_shape": null}, "class_name": "SpatialDropout2D"}, {"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "name": "conv2d_8", "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_4", "trainable": true, "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "seed": null, "rate": 0.5, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "trainable": false, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "activation": "softmax", "kernel_regularizer": null, "units": 155, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}