{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_1", "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "filters": 32, "batch_input_shape": [null, 150, 150, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "trainable": false, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "SpatialDropout2D", "config": {"trainable": false, "noise_shape": null, "name": "spatial_dropout2d_1", "seed": null, "rate": 0.5}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_2", "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "filters": 32, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": false, "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_3", "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "filters": 64, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "SpatialDropout2D", "config": {"trainable": false, "noise_shape": null, "name": "spatial_dropout2d_2", "seed": null, "rate": 0.5}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_4", "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "filters": 64, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": false, "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_5", "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "filters": 128, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "SpatialDropout2D", "config": {"trainable": false, "noise_shape": null, "name": "spatial_dropout2d_3", "seed": null, "rate": 0.5}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_6", "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "filters": 128, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": false, "pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_7", "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "filters": 256, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "SpatialDropout2D", "config": {"trainable": true, "noise_shape": null, "name": "spatial_dropout2d_4", "seed": null, "rate": 0.5}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_8", "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "filters": 256, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_4", "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "trainable": false, "activation": "softmax", "units": 155}}]}}