{"backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "batch_input_shape": [null, 150, 150, 3], "use_bias": true, "kernel_constraint": null, "dtype": "float32", "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "padding": "valid", "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_1"}}, {"class_name": "SpatialDropout2D", "config": {"seed": null, "rate": 0.7, "name": "spatial_dropout2d_1", "noise_shape": null, "trainable": false}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "filters": 32, "bias_regularizer": null, "name": "conv2d_2"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": false, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "filters": 64, "bias_regularizer": null, "name": "conv2d_3"}}, {"class_name": "SpatialDropout2D", "config": {"seed": null, "rate": 0.7, "name": "spatial_dropout2d_2", "noise_shape": null, "trainable": false}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "filters": 64, "bias_regularizer": null, "name": "conv2d_4"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": false, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "filters": 128, "bias_regularizer": null, "name": "conv2d_5"}}, {"class_name": "SpatialDropout2D", "config": {"seed": null, "rate": 0.7, "name": "spatial_dropout2d_3", "noise_shape": null, "trainable": false}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "filters": 128, "bias_regularizer": null, "name": "conv2d_6"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": false, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "filters": 256, "bias_regularizer": null, "name": "conv2d_7"}}, {"class_name": "SpatialDropout2D", "config": {"seed": null, "rate": 0.7, "name": "spatial_dropout2d_4", "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "filters": 256, "bias_regularizer": null, "name": "conv2d_8"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_4", "data_format": "channels_last", "trainable": true, "padding": "valid"}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.7, "name": "dropout_1", "noise_shape": null, "trainable": true}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 155, "activation": "softmax", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}}}], "name": "sequential_1"}, "keras_version": "2.2.4"}