{"config": {"name": "sequential_1", "layers": [{"config": {"use_bias": true, "name": "conv2d_1", "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": false, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "batch_input_shape": [null, 150, 150, 3], "strides": [1, 1], "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"seed": null, "trainable": false, "name": "spatial_dropout2d_1", "rate": 0.5, "noise_shape": null}, "class_name": "SpatialDropout2D"}, {"config": {"use_bias": true, "name": "conv2d_2", "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": false, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": false, "name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "name": "conv2d_3", "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": false, "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"seed": null, "trainable": false, "name": "spatial_dropout2d_2", "rate": 0.5, "noise_shape": null}, "class_name": "SpatialDropout2D"}, {"config": {"use_bias": true, "name": "conv2d_4", "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": false, "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": false, "name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "name": "conv2d_5", "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": false, "filters": 128, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"seed": null, "trainable": false, "name": "spatial_dropout2d_3", "rate": 0.5, "noise_shape": null}, "class_name": "SpatialDropout2D"}, {"config": {"use_bias": true, "name": "conv2d_6", "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": false, "filters": 128, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": false, "name": "max_pooling2d_3", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "name": "conv2d_7", "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 256, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"seed": null, "trainable": true, "name": "spatial_dropout2d_4", "rate": 0.5, "noise_shape": null}, "class_name": "SpatialDropout2D"}, {"config": {"use_bias": true, "name": "conv2d_8", "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "filters": 256, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_4", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "trainable": true, "name": "dropout_1", "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "units": 155, "name": "dense_1", "kernel_regularizer": null, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "trainable": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}