{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 32, "padding": "valid", "batch_input_shape": [null, 150, 150, 3], "trainable": false, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_1", "strides": [1, 1], "activation": "relu", "kernel_constraint": null}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_1", "rate": 0.7, "noise_shape": null, "seed": null, "trainable": false}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 32, "padding": "valid", "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_2", "strides": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": false, "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "padding": "valid", "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_3", "strides": [1, 1], "activation": "relu"}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_2", "rate": 0.7, "noise_shape": null, "seed": null, "trainable": false}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "padding": "valid", "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_4", "strides": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": false, "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "padding": "valid", "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_5", "strides": [1, 1], "activation": "relu"}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_3", "rate": 0.7, "noise_shape": null, "seed": null, "trainable": false}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "padding": "valid", "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_6", "strides": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": false, "name": "max_pooling2d_3", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "padding": "valid", "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_7", "strides": [1, 1], "activation": "relu"}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_4", "rate": 0.7, "noise_shape": null, "seed": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "padding": "valid", "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_8", "strides": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_4", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.7, "noise_shape": null, "seed": null, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true, "units": 155, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_constraint": null}}]}}