{"class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "batch_input_shape": [null, 150, 150, 3], "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 32, "dilation_rate": [1, 1], "trainable": true, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "use_bias": true, "name": "conv2d_1", "data_format": "channels_last", "activation": "relu", "padding": "valid", "kernel_size": [3, 3]}}, {"class_name": "SpatialDropout2D", "config": {"seed": null, "trainable": true, "rate": 0.5, "noise_shape": null, "name": "spatial_dropout2d_1"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "data_format": "channels_last", "activation": "relu", "padding": "valid", "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "data_format": "channels_last", "activation": "relu", "padding": "valid", "kernel_size": [3, 3]}}, {"class_name": "SpatialDropout2D", "config": {"seed": null, "trainable": true, "rate": 0.5, "noise_shape": null, "name": "spatial_dropout2d_2"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "data_format": "channels_last", "activation": "relu", "padding": "valid", "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "data_format": "channels_last", "activation": "relu", "padding": "valid", "kernel_size": [3, 3]}}, {"class_name": "SpatialDropout2D", "config": {"seed": null, "trainable": true, "rate": 0.5, "noise_shape": null, "name": "spatial_dropout2d_3"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "data_format": "channels_last", "activation": "relu", "padding": "valid", "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_7", "data_format": "channels_last", "activation": "relu", "padding": "valid", "kernel_size": [3, 3]}}, {"class_name": "SpatialDropout2D", "config": {"seed": null, "trainable": true, "rate": 0.5, "noise_shape": null, "name": "spatial_dropout2d_4"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_8", "data_format": "channels_last", "activation": "relu", "padding": "valid", "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_4", "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.5, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 155, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activation": "softmax", "trainable": true}}], "name": "sequential_1"}, "keras_version": "2.2.4"}