{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "activation": "relu", "dtype": "float32", "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_1", "filters": 32, "batch_input_shape": [null, 150, 150, 3], "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_1", "trainable": false, "rate": 0.7, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "activation": "relu", "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_2", "filters": 32, "padding": "valid", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": false, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "activation": "relu", "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_3", "filters": 64, "padding": "valid", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_2", "trainable": false, "rate": 0.7, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "activation": "relu", "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_4", "filters": 64, "padding": "valid", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": false, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "activation": "relu", "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_5", "filters": 128, "padding": "valid", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_3", "trainable": false, "rate": 0.7, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "activation": "relu", "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_6", "filters": 128, "padding": "valid", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": false, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "activation": "relu", "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_7", "filters": 256, "padding": "valid", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_4", "trainable": true, "rate": 0.7, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "activation": "relu", "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_8", "filters": 256, "padding": "valid", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_4", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.7, "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "softmax", "units": 155, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null}}]}, "class_name": "Sequential"}