{"config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 32, "activation": "relu", "dtype": "float32", "trainable": false, "batch_input_shape": [null, 150, 150, 3], "name": "conv2d_1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_1", "noise_shape": null, "seed": null, "trainable": false, "rate": 0.5}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 32, "activation": "relu", "use_bias": true, "trainable": false, "name": "conv2d_2", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": false, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "activation": "relu", "use_bias": true, "trainable": false, "name": "conv2d_3", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_2", "noise_shape": null, "seed": null, "trainable": false, "rate": 0.5}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "activation": "relu", "use_bias": true, "trainable": false, "name": "conv2d_4", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": false, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 128, "activation": "relu", "use_bias": true, "trainable": false, "name": "conv2d_5", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_3", "noise_shape": null, "seed": null, "trainable": false, "rate": 0.5}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 128, "activation": "relu", "use_bias": true, "trainable": false, "name": "conv2d_6", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": false, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "activation": "relu", "use_bias": true, "trainable": true, "name": "conv2d_7", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatial_dropout2d_4", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.5}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "activation": "relu", "use_bias": true, "trainable": true, "name": "conv2d_8", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "units": 155, "use_bias": true, "activation": "softmax", "name": "dense_1", "bias_regularizer": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}