{"config": {"layers": [{"config": {"padding": "valid", "activity_regularizer": null, "name": "conv2d_1", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "filters": 32, "batch_input_shape": [null, 150, 150, 3], "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"seed": null, "trainable": false, "name": "spatial_dropout2d_1", "rate": 0.5, "noise_shape": null}, "class_name": "SpatialDropout2D"}, {"config": {"padding": "valid", "activity_regularizer": null, "name": "conv2d_2", "strides": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 32, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "trainable": false, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "activity_regularizer": null, "name": "conv2d_3", "strides": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 64, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"seed": null, "trainable": false, "name": "spatial_dropout2d_2", "rate": 0.5, "noise_shape": null}, "class_name": "SpatialDropout2D"}, {"config": {"padding": "valid", "activity_regularizer": null, "name": "conv2d_4", "strides": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 64, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "trainable": false, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "activity_regularizer": null, "name": "conv2d_5", "strides": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 128, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"seed": null, "trainable": false, "name": "spatial_dropout2d_3", "rate": 0.5, "noise_shape": null}, "class_name": "SpatialDropout2D"}, {"config": {"padding": "valid", "activity_regularizer": null, "name": "conv2d_6", "strides": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 128, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "trainable": false, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "activity_regularizer": null, "name": "conv2d_7", "strides": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 256, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "trainable": false, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"seed": null, "trainable": false, "name": "spatial_dropout2d_4", "rate": 0.5, "noise_shape": null}, "class_name": "SpatialDropout2D"}, {"config": {"padding": "valid", "activity_regularizer": null, "name": "conv2d_8", "strides": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 256, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_4", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "trainable": true, "name": "dropout_1", "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "use_bias": true, "activation": "softmax", "units": 155, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "trainable": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}