{"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"activation": "relu", "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "dtype": "float32", "padding": "valid", "name": "conv2d_1", "data_format": "channels_last", "bias_constraint": null, "filters": 32, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 150, 150, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "SpatialDropout2D", "config": {"seed": null, "trainable": false, "name": "spatial_dropout2d_1", "noise_shape": null, "rate": 0.7}}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_size": [3, 3], "trainable": false, "padding": "valid", "name": "conv2d_2", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "filters": 32, "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": false, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_size": [3, 3], "trainable": false, "padding": "valid", "name": "conv2d_3", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "filters": 64, "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "SpatialDropout2D", "config": {"seed": null, "trainable": false, "name": "spatial_dropout2d_2", "noise_shape": null, "rate": 0.7}}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_size": [3, 3], "trainable": false, "padding": "valid", "name": "conv2d_4", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "filters": 64, "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": false, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_size": [3, 3], "trainable": false, "padding": "valid", "name": "conv2d_5", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "filters": 128, "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "SpatialDropout2D", "config": {"seed": null, "trainable": false, "name": "spatial_dropout2d_3", "noise_shape": null, "rate": 0.7}}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_size": [3, 3], "trainable": false, "padding": "valid", "name": "conv2d_6", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "filters": 128, "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": false, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_size": [3, 3], "trainable": true, "padding": "valid", "name": "conv2d_7", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "filters": 256, "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "SpatialDropout2D", "config": {"seed": null, "trainable": true, "name": "spatial_dropout2d_4", "noise_shape": null, "rate": 0.7}}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_size": [3, 3], "trainable": true, "padding": "valid", "name": "conv2d_8", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "filters": 256, "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_4", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.7}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activation": "softmax", "trainable": true, "units": 155, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}], "name": "sequential_1"}, "keras_version": "2.2.4", "backend": "tensorflow"}