{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_1", "kernel_constraint": null, "filters": 32, "trainable": true, "strides": [1, 1], "dtype": "float32", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "batch_input_shape": [null, 150, 150, 3], "padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last"}}, {"class_name": "SpatialDropout2D", "config": {"seed": null, "noise_shape": null, "name": "spatial_dropout2d_1", "rate": 0.5, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2", "kernel_constraint": null, "filters": 32, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_3", "kernel_constraint": null, "filters": 64, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last"}}, {"class_name": "SpatialDropout2D", "config": {"seed": null, "noise_shape": null, "name": "spatial_dropout2d_2", "rate": 0.5, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_4", "kernel_constraint": null, "filters": 64, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_5", "kernel_constraint": null, "filters": 128, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last"}}, {"class_name": "SpatialDropout2D", "config": {"seed": null, "noise_shape": null, "name": "spatial_dropout2d_3", "rate": 0.5, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_6", "kernel_constraint": null, "filters": 128, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_3", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_7", "kernel_constraint": null, "filters": 256, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last"}}, {"class_name": "SpatialDropout2D", "config": {"seed": null, "noise_shape": null, "name": "spatial_dropout2d_4", "rate": 0.5, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_8", "kernel_constraint": null, "filters": 256, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_4", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "name": "dropout_1", "rate": 0.5, "trainable": true}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_constraint": null, "units": 155, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true}}]}, "keras_version": "2.2.4", "backend": "tensorflow"}