{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"kernel_size": [3, 3], "batch_input_shape": [null, 150, 150, 3], "trainable": false, "kernel_constraint": null, "name": "conv2d_1", "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "filters": 32}, "class_name": "Conv2D"}, {"config": {"trainable": false, "rate": 0.5, "seed": null, "noise_shape": null, "name": "spatial_dropout2d_1"}, "class_name": "SpatialDropout2D"}, {"config": {"kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "name": "conv2d_2", "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "filters": 32}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": false, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "name": "conv2d_3", "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "filters": 64}, "class_name": "Conv2D"}, {"config": {"trainable": false, "rate": 0.5, "seed": null, "noise_shape": null, "name": "spatial_dropout2d_2"}, "class_name": "SpatialDropout2D"}, {"config": {"kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "name": "conv2d_4", "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "filters": 64}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": false, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "name": "conv2d_5", "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "filters": 128}, "class_name": "Conv2D"}, {"config": {"trainable": false, "rate": 0.5, "seed": null, "noise_shape": null, "name": "spatial_dropout2d_3"}, "class_name": "SpatialDropout2D"}, {"config": {"kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "name": "conv2d_6", "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "filters": 128}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": false, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "name": "conv2d_7", "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "filters": 256}, "class_name": "Conv2D"}, {"config": {"trainable": false, "rate": 0.5, "seed": null, "noise_shape": null, "name": "spatial_dropout2d_4"}, "class_name": "SpatialDropout2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "name": "conv2d_8", "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "filters": 256}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_4", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.5, "seed": null, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": false, "kernel_constraint": null, "units": 155, "name": "dense_1", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4"}