{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "trainable": false, "name": "conv2d_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "batch_input_shape": [null, 150, 150, 3], "activity_regularizer": null, "filters": 32, "kernel_size": [3, 3], "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "SpatialDropout2D", "config": {"rate": 0.7, "trainable": false, "name": "spatial_dropout2d_1", "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_2", "activity_regularizer": null, "trainable": false, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "filters": 32, "kernel_size": [3, 3], "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": false}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_3", "activity_regularizer": null, "trainable": false, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "filters": 64, "kernel_size": [3, 3], "bias_regularizer": null}}, {"class_name": "SpatialDropout2D", "config": {"rate": 0.7, "trainable": false, "name": "spatial_dropout2d_2", "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_4", "activity_regularizer": null, "trainable": false, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "filters": 64, "kernel_size": [3, 3], "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": false}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_5", "activity_regularizer": null, "trainable": false, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "filters": 128, "kernel_size": [3, 3], "bias_regularizer": null}}, {"class_name": "SpatialDropout2D", "config": {"rate": 0.7, "trainable": false, "name": "spatial_dropout2d_3", "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_6", "activity_regularizer": null, "trainable": false, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "filters": 128, "kernel_size": [3, 3], "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": false}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_7", "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "filters": 256, "kernel_size": [3, 3], "bias_regularizer": null}}, {"class_name": "SpatialDropout2D", "config": {"rate": 0.7, "trainable": true, "name": "spatial_dropout2d_4", "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_8", "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "filters": 256, "kernel_size": [3, 3], "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_4", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.7, "trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "trainable": true, "name": "dense_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "units": 155, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}]}}